<?php

return [
    // +----------------------------------------------------------------------
    // | redis应用设置
    // +----------------------------------------------------------------------

    /*
     * -----------------------------------------------------------
     * 基本相关
     * -----------------------------------------------------------
     */

    //学生借阅图书最大数限制
    'borrow_max' => 5,

    //管理员
    'admin' => [
        'select'=>4,    //缓存库
        'timeout'=>10 * 86400,    //过期时间
        'table_name'=>'管理员',
    ],

    //分类
    'category' => [
        'select'=>1,
        'timeout'=>30 * 86400,    //过期时间
        'table_name'=>'角色',
    ],

    //书籍
    'book' => [
        'select'=>2,
        'timeout'=>30 * 86400,    //过期时间
        'table_name'=>'角色',
    ],

    //学生
    'student' => [
        'select'=>3,
        'timeout'=>30 * 86400,    //过期时间
        'table_name'=>'学生',
    ],
    //借阅书籍
    'borrow' => [
        'select'=>4,
        'timeout'=>30 * 86400,    //过期时间
        'table_name'=>'借阅书籍',
    ],


];